cask_args appdir: "/Applications"

# brew tap
tap "homebrew/cask-fonts"
tap "homebrew/bundle"
tap "homebrew/cask"
tap "homebrew/core"
tap "homebrew/services"


# mas install - BASE

mas "1Blocker", id: 1107421413
mas "Bear", id: 1091189122
mas "Compressor", id: 424390742
mas "Divvy", id: 413857545
mas "Disk Speed Test", id: 425264550
mas "Evernote Web Clipper", id: 1481669779
mas "Fantastical", id: 975937182
mas "Final Cut Pro", id: 424389933
mas "Jira", id: 1475897096
mas "Keynote", id: 409183694
mas "Mactracker", id: 430255202
mas "Motion", id: 434290957
mas "Numbers", id: 409203825
mas "Pages", id: 409201541
mas "Reeder", id: 880001334
mas "ReadKit", id: 588726889
mas "Remote Desktop", id: 409907375
mas "Sequel Ace", id: 1518036000
mas "Slack", id: 803453959
mas "The Unarchiver", id: 425424353
mas "Twitter", id: 409789998
mas "Type2Phone", id: 472717129
mas "Xcode", id: 497799835


#mas install - OPTIONAL

#mas "Bee", id: 726099620
#mas "Bridge Constructor Portal", id: 1316061122
#mas "CamControl", id: 1503271162
#mas "Dark Reader for Safari", id: 1438243180
#mas "Decked Builder Lite", id: 406317734
#mas "Display Menu", id: 549083868
#mas "EasyFind", id: 411673888
#mas "Encrypto", id: 935235287
#mas "GarageBand", id: 682658836
#mas "Geekbench 4", id: 1175706108
#mas "Geekbench 5", id: 1478447657
#mas "GIF Keyboard", id: 1043270657
#mas "Gifox", id: 1082624744
#mas "GIPHY CAPTURE", id: 668208984
#mas "iHosts", id: 1102004240
#mas "Image2icon", id: 992115977
#mas "iMovie", id: 408981434
#mas "Install macOS Sierra", id: 1127487414
#mas "iUnarchive", id: 418517475
#mas "LanScan", id: 472226235
#mas "Marked 2", id: 890031187
#mas "Micro Snitch", id: 972028355
#mas "Minesweeper Deluxe", id: 657011614
#mas "Monosnap", id: 540348655
#mas "Network Logger Pro", id: 764324406
#mas "Network Speed Tester", id: 1217419133
#mas "OmniGraffle", id: 1142578753
#mas "Playgrounds", id: 1496833156
#mas "Pocket", id: 568494494
#mas "QVR Client", id: 806101067
#mas "Reacting Live", id: 1510179491
#mas "Server", id: 883878097
#mas "SnipperApp 2", id: 1469182443
#mas "Speedtest", id: 1153157709
#mas "SSH Copy", id: 823961613
#mas "SSH Tunnel", id: 734418810
#mas "ToothFairy", id: 1191449274
#mas "Twitter", id: 409789998
#mas "Visualizer", id: 1296177026
#mas "Webcam Settings", id: 533696630
#mas "WiFi Explorer", id: 494803304
#mas "Wipr", id: 1320666476
#mas "WorldCard", id: 1012314348



# brew cask install - BASE

cask "1password"
cask "1password-cli"
cask "alfred"
cask "bettertouchtool"
cask "betterzip"
cask "cakebrew"
cask "cheatsheet"
cask "choosy"
cask "dash"
cask "discord"
cask "firefox"
cask "fission"
cask "fluid"
cask "google-chrome"
cask "google-cloud-sdk"
cask "handbrake"
cask "iterm2"
cask "insomnia"
cask "linkliar"
cask "lulu"
cask "micro-snitch"
cask "obs"
cask "plex"
cask "postman"
cask "powershell"
cask "provisionql"
cask "qlcolorcode"
cask "qlimagesize"
cask "qlmarkdown"
cask "quicklook-json"
cask "sequel-pro"
cask "signal"
cask "sqleditor"
cask "suspicious-package"
cask "sublime-text"
cask "steam"
cask "tor-browser"
cask "transmit"
cask "valentina-studio"
cask "visual-studio-code"
cask "vlc"
cask "vmware-fusion"
cask "wondershare-uniconverter"
cask "zoomus"



#brew cask install - OPTIONAL

#cask "chronosync"
#cask "cocoarestclient"
#cask "fantasy-grounds"
#cask "openemu"
#cask "mailplane"
#cask "netspot"
#cask "omniplan"
#cask "paw"
#cask "product-hunt"
#cask "pluralsight"
#cask "spotify"
#cask "tableplus"
#cask "trophy"




## brew install - BASE

# Faster search replacement for grep
brew "ack"
#cat with syntax highlighting
brew "bat"
# Distributed revision control system
brew "git"
# GNU Pretty Good Privacy (PGP) package
brew "gnupg"
#CLI GUI Process Manager
brew "htop"
#command line HTTP client for APIs
brew "httpie"
#CLI GUI for Git
brew "lazygit"
#CLI Logviewer
brew "lnav"
# Mac App Store command-line interface
brew "mas"
brew "node"
# Manage multiple Node.js versions
brew "nvm"
brew "tldr"
#Fast complete searches of codebase and folders (ag)
brew "the_silver_searcher"
# Cryptography and SSL/TLS Toolkit
brew "openssl@1.1"
# Manage compile and link flags for libraries
brew "pkg-config"
# Display directories as trees (with optional color/HTML output)
brew "tree"
# Internet file retriever
brew "wget"
brew "youtube-dl"
brew "zsh"
